/*
 Аппаратная конфигурация пульта оперативного управления
 */
 //========================================================================
 //------------------------- АППАРАТНАЯ КОНФИГУРАЦИЯ ----------------------
 //========================================================================

//--- Ресурсы платы пульта
 
 //Зуммер
 #define PIN_PIEZO 3  
 
 // Кнопки
 #define KEY_1 33   //*ВКЛ ПЗ
 #define KEY_2 39   //*КОНТР ИНД
 #define KEY_3 40   //*РЕЖИМ
 #define KEY_4 41   //*ХОД/ЗАПИСЬ
 #define KEY_5 42   //*АВАРИЯ/СТОП
 #define KEY_6 38   //*БР
 #define KEY_7 37   //*ОФС
 #define KEY_8 36   //*БПС
 #define KEY_9 35   //*УАС
 #define KEY_10 34  //*МФС

 // Индикаторы
 #define LED1 22    //*ВКЛ ПЗ
 #define LED2 28    //*ХОД/ЗАПИСЬ
 #define LED3 29    //ОТКАЗ
 #define LED4 30    //*ЗАГРУЗКА БП
 #define LED5 31    //*РАЗГРУЗКА БП
 #define LED6 32    //*РАБОТА ПЗ
 #define LED7 23    //*МФС
 #define LED8 24    //*УАС
 #define LED9 25    //*БПС
 #define LED10 26   //*ОФС
 #define LED11 27   //*БР
 

 //========================================================================
 //-------------------------------- КОНСТАНТЫ -----------------------------
 //========================================================================
 
 #define TONE_FREQUENCY 1000    //Частота тонального сигнала
 #define TONE_DWELL 100         //Длительность тонального сигнала

 #define UDP_BUFFER_SIZE 128    //Размер буфера для приёма и передачи данных по UDP

 #define BASE_HEADER_LENGTH 11  //Длина заголовка базового протокола
